In [107]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt
from scipy import randn

%matplotlib inline

In [5]:
# Series
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3])

In [7]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [9]:
obj2 = Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2['a']

-5

In [12]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
# A series is like a fixed length, ordered dictionary
'b' in obj2

True

In [18]:
'e' in obj2

False

In [19]:
sdata = {'Ohio' : 35000,
        'Texas' : 71000,
        'Oregon' : 16000,
        'Utah' : 5000}

In [22]:
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [25]:
obj4 = Series(sdata, index = states)
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [26]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [30]:
obj4.name = 'population'
obj4.index.name = 'state'

In [31]:
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [32]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [33]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [5]:
# DataFrames
data = {'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year' : [2000, 2001, 2002, 2001, 2002],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9]}

In [7]:
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [8]:
DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [9]:
frame.columns

Index([u'pop', u'state', u'year'], dtype='object')

In [10]:
frame2 = DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                   index = ['one', 'two', 'three', 'four', 'five'])

In [11]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [12]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [13]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [14]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [16]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [18]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [19]:
cat = [0, 1, 2, 3, 4, 5, 6, 7, 8]
cat[1:7]

[1, 2, 3, 4, 5, 6]

In [20]:
val = Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [21]:
frame2['debt'] = val

In [22]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [23]:
frame2['eastern'] = frame2.state == 'Ohio'

In [24]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [25]:
del frame2['eastern']

In [26]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [27]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [29]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [30]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [31]:
DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [32]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [33]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [34]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [35]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [36]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [37]:
# Index objects
obj = Series(range(3), index = ['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [39]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [41]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index = index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [42]:
obj2.index is index

True

In [43]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [44]:
'Ohio' in frame3.columns

True

In [45]:
2003 in frame3.index

False

In [47]:
# Reindexing - make a new object with the data conformed to a new 
#index
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [50]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [51]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [53]:
# Forward fill reindexing
obj3 = Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [54]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [55]:
frame = DataFrame(np.arange(9).reshape((3, 3)), 
                  index = ['a', 'c', 'd'],
                 columns = ['Ohio', 'Texas', 'California'])

In [56]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [57]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [58]:
states = ['Texas', 'Utah', 'California']
frame.reindex(index = ['a', 'b', 'c', 'd'],
             method = 'ffill',
             columns = states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [60]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

In [61]:
obj = Series(np.arange(5.), 
             index = ['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')

In [62]:
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [63]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: float64

In [64]:
data = DataFrame(np.arange(16).reshape(4, 4),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['one', 'two', 'three', 'four'])

In [65]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data.drop('two', axis = 1) # Need to specify it is axis 1 (cols)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [67]:
# Indexing, selection, and filtering
obj = Series(np.arange(4.),
            index = ['a', 'b', 'c', 'd'])

In [68]:
obj['b']

1.0

In [69]:
obj[1]

1.0

In [70]:
obj[2:4]

c    2
d    3
dtype: float64

In [71]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [72]:
# The endpoint is inclusive when slicing with labels
obj['b':'c']

b    1
c    2
dtype: float64

In [74]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: float64

In [75]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['one', 'two', 'three', 'four'])

In [76]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [78]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [79]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [80]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [83]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [85]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [86]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [87]:
# Arithmetic and data alignment
s1 = Series([7.3, -2.5, 3.4, 1.5], 
            index = ['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1],
           index = ['a', 'c', 'e', 'f', 'g'])

In [88]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [89]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [90]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [91]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)),
               columns = list('bcd'),
               index = ['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)),
               columns = list('bde'),
               index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [92]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [93]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [94]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [110]:
# Arithmetic methods with fill values
df1 = DataFrame(np.arange(12.).reshape((3, 4)),
               columns = list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)),
               columns = list('abcde'))

In [111]:
df1 + df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [112]:
df1.add(df2, fill_value = 0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [113]:
df1.reindex(columns = df2.columns, fill_value = 0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [114]:
# Operations between DataFrame and Series
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [115]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [116]:
arr - arr[0] # This is broadcasting (see Ch. 12)

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [118]:
frame = DataFrame(np.arange(12.).reshape((4, 3)),
                 columns = list('bde'),
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]

In [119]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [120]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [121]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [122]:
series2 = Series(range(3), index = ['b', 'e', 'f'])

In [123]:
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [124]:
series3 = frame['d']

In [125]:
frame.sub(series3, axis = 0) # The axis is which axis to match on.

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [126]:
# Function application and mapping
frame = DataFrame(np.random.randn(4, 3),
                 columns = list('bde'),
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [127]:
frame

               b         d         e
Utah    0.782010 -0.484630  0.632735
Ohio    0.104684  1.471603  1.414713
Texas   0.818078  0.048251 -1.391616
Oregon  0.068604 -0.748354  0.263001

In [128]:
np.abs(frame)

               b         d         e
Utah    0.782010  0.484630  0.632735
Ohio    0.104684  1.471603  1.414713
Texas   0.818078  0.048251  1.391616
Oregon  0.068604  0.748354  0.263001

In [129]:
f = lambda x: x.max() - x.min()

In [130]:
frame.apply(f)

b    0.749474
d    2.219957
e    2.806329
dtype: float64

In [131]:
frame.apply(f, axis = 1)

Utah      1.266640
Ohio      1.366919
Texas     2.209694
Oregon    1.011355
dtype: float64

In [132]:
def f(x):
    return Series([x.min(), x.max()], 
                 index = ['min', 'max'])

In [133]:
frame.apply(f)

            b         d         e
min  0.068604 -0.748354 -1.391616
max  0.818078  1.471603  1.414713

In [134]:
# applymap for element-wise functions
format = lambda x: '%.2f' % x
frame.applymap(format)

           b      d      e
Utah    0.78  -0.48   0.63
Ohio    0.10   1.47   1.41
Texas   0.82   0.05  -1.39
Oregon  0.07  -0.75   0.26

In [135]:
frame['e'].map(format)

Utah       0.63
Ohio       1.41
Texas     -1.39
Oregon     0.26
Name: e, dtype: object

In [137]:
# Sorting and ranking
obj = Series(range(4), index = ['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [138]:
frame = DataFrame(np.arange(8).reshape((2, 4)),
                 index = ['three', 'one'],
                 columns = ['d', 'a', 'b', 'c'])

In [139]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [140]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [141]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [143]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [144]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [145]:
# Sorting on more than one column
frame = DataFrame({'b': [4, 7, -3, 2],
                  'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [147]:
frame.sort_values(by = 'b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [148]:
frame.sort_values(by = ['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [149]:
# Ranking
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [150]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [151]:
obj.rank(method = 'first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [152]:
obj.rank(ascending = False, method = 'max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [153]:
frame = DataFrame({'b': [4.3, 7, -3, 2],
                  'a': [0, 1, 0, 1],
                  'c': [-2, 5, 8, -2.5]})

In [154]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [155]:
frame.rank(axis = 1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

In [156]:
# Axis indexes with duplicate values
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [157]:
obj.index.is_unique

False

In [158]:
obj['a'] # Returns a series

a    0
a    1
dtype: int64

In [159]:
obj['c'] # Returns a scalar

4

In [161]:
df = DataFrame(np.random.randn(4, 3), index = ['a', 'a', 'b', 'b'])
df

          0         1         2
a  1.184480 -1.548887  1.887331
a -0.454484 -0.269377  0.944026
b -0.613553 -1.231092 -2.394226
b -1.178837 -0.256076  0.314045

In [162]:
df.ix['b']

          0         1         2
b -0.613553 -1.231092 -2.394226
b -1.178837 -0.256076  0.314045

In [163]:
# Summarising and computing descriptive statistics
# All built to exclude missing data
df = DataFrame([[1.4, np.nan],
               [7.1, -4.5],
               [np.nan, np.nan],
               [0.75, -1.3]],
               index = ['a', 'b', 'c', 'd'],
               columns = ['one', 'two'])

In [164]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [165]:
df.sum() # Column sum

one    9.25
two   -5.80
dtype: float64

In [166]:
df.sum(axis = 1) # Row sum

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [167]:
df.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [168]:
df.idxmax()

one    b
two    d
dtype: object

In [169]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [170]:
df.describe() # Summary table by column

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [172]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [173]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [174]:
# Correlation and covariance
import pandas.io.data as web

/Users/jburchell/.virtualenvs/daup/lib/python2.7/site-packages/pandas/io/data.py:33: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [176]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOGL']:
    all_data[ticker] = web.get_data_yahoo(ticker, 
                                          '1/1/2000', '1/1/2010')

In [177]:
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                   for tic, data in all_data.iteritems()})

In [178]:
returns = price.pct_change()

In [179]:
returns.tail()

                AAPL     GOOGL       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [180]:
returns.MSFT.corr(returns.IBM)

0.49597971677176494

In [181]:
returns.MSFT.cov(returns.IBM)

0.00021595765217240524

In [182]:
returns.corr()

           AAPL     GOOGL       IBM      MSFT
AAPL   1.000000  0.470676  0.410011  0.424305
GOOGL  0.470676  1.000000  0.390689  0.443587
IBM    0.410011  0.390689  1.000000  0.495980
MSFT   0.424305  0.443587  0.495980  1.000000

In [183]:
returns.cov()

           AAPL     GOOGL       IBM      MSFT
AAPL   0.001027  0.000303  0.000252  0.000309
GOOGL  0.000303  0.000580  0.000142  0.000205
IBM    0.000252  0.000142  0.000367  0.000216
MSFT   0.000309  0.000205  0.000216  0.000516

In [184]:
returns.corrwith(returns.IBM)

AAPL     0.410011
GOOGL    0.390689
IBM      1.000000
MSFT     0.495980
dtype: float64

In [185]:
returns.corrwith(volume)

AAPL    -0.057549
GOOGL    0.062648
IBM     -0.007892
MSFT    -0.014245
dtype: float64

In [186]:
# Unique values, value counts and membership
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [188]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [190]:
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [191]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [192]:
pd.value_counts(obj.values, sort = False)

a    3
c    3
b    2
d    1
dtype: int64

In [193]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [194]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [195]:
# Set up for histograms on multiple columns
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                 'Qu2': [2, 3, 1, 2, 3],
                 'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [196]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

In [197]:
# Handling missing data
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [198]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [199]:
string_data[0] = None

In [200]:
string_data.isnull() # None is treated as NA value

0     True
1    False
2     True
3    False
dtype: bool

In [201]:
# Filtering out missing data
from numpy import nan as NA

In [202]:
data = Series([1, NA, 3.5, NA, 7]) # Same as np.nan, see import above

In [203]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [204]:
# Alternative is:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [205]:
# In dataframes, dropna drops any ROW containing a missing value
data = DataFrame([[1., 6.5, 3.],
                 [1., NA, NA],
                 [NA, NA, NA],
                 [NA, 6.5, 3.]])

In [206]:
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [208]:
cleaned = data.dropna()
cleaned

   0    1  2
0  1  6.5  3

In [209]:
# Pass all to drop only rows that are ALL NA
data.dropna(how = 'all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [210]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [211]:
data.dropna(axis = 1, how = 'all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [212]:
# Keep rows with a certain number of observations
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA
df

          0         1         2
0  0.596117       NaN       NaN
1  1.464700       NaN       NaN
2  1.154256       NaN       NaN
3 -0.514822       NaN  0.567983
4  2.034886       NaN -2.366279
5 -0.394484 -0.789473 -0.321901
6  0.275040  0.024356  0.366811

In [213]:
df.dropna(thresh = 3)

          0         1         2
5 -0.394484 -0.789473 -0.321901
6  0.275040  0.024356  0.366811

In [214]:
# Filling in missing data
df.fillna(0)

          0         1         2
0  0.596117  0.000000  0.000000
1  1.464700  0.000000  0.000000
2  1.154256  0.000000  0.000000
3 -0.514822  0.000000  0.567983
4  2.034886  0.000000 -2.366279
5 -0.394484 -0.789473 -0.321901
6  0.275040  0.024356  0.366811

In [215]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.596117  0.500000       NaN
1  1.464700  0.500000       NaN
2  1.154256  0.500000       NaN
3 -0.514822  0.500000  0.567983
4  2.034886  0.500000 -2.366279
5 -0.394484 -0.789473 -0.321901
6  0.275040  0.024356  0.366811

In [216]:
# Replace original dataframe
_ = df.fillna(0, inplace = True)
df

          0         1         2
0  0.596117  0.000000  0.000000
1  1.464700  0.000000  0.000000
2  1.154256  0.000000  0.000000
3 -0.514822  0.000000  0.567983
4  2.034886  0.000000 -2.366279
5 -0.394484 -0.789473 -0.321901
6  0.275040  0.024356  0.366811

In [217]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA
df.ix[4:, 2] = NA
df

          0         1         2
0 -0.784121 -1.265394 -0.062513
1 -0.794948 -2.688595 -0.575840
2  0.071610       NaN -1.749209
3  1.216416       NaN  0.636781
4  0.789908       NaN       NaN
5 -0.172382       NaN       NaN

In [218]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.784121 -1.265394 -0.062513
1 -0.794948 -2.688595 -0.575840
2  0.071610 -2.688595 -1.749209
3  1.216416 -2.688595  0.636781
4  0.789908 -2.688595  0.636781
5 -0.172382 -2.688595  0.636781

In [219]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.784121 -1.265394 -0.062513
1 -0.794948 -2.688595 -0.575840
2  0.071610 -2.688595 -1.749209
3  1.216416 -2.688595  0.636781
4  0.789908       NaN  0.636781
5 -0.172382       NaN  0.636781

In [220]:
# Mean/median replacement
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [222]:
# Hierarchical indexing - MultiIndex
data = Series(np.random.randn(10),
             index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 
                       'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.156709
   2    0.112015
   3   -0.180330
b  1    1.330953
   2   -0.830793
   3   -0.825411
c  1    0.298686
   2    0.396654
d  2   -1.135701
   3   -0.998360
dtype: float64

In [223]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [224]:
data['b']

1    1.330953
2   -0.830793
3   -0.825411
dtype: float64

In [225]:
data['b':'c']

b  1    1.330953
   2   -0.830793
   3   -0.825411
c  1    0.298686
   2    0.396654
dtype: float64

In [226]:
data.ix[['b', 'd']]

b  1    1.330953
   2   -0.830793
   3   -0.825411
d  2   -1.135701
   3   -0.998360
dtype: float64

In [227]:
data[:, 2]

a    0.112015
b   -0.830793
c    0.396654
d   -1.135701
dtype: float64

In [228]:
data.unstack()

          1         2         3
a -0.156709  0.112015 -0.180330
b  1.330953 -0.830793 -0.825411
c  0.298686  0.396654       NaN
d       NaN -1.135701 -0.998360

In [229]:
data.unstack().stack()

a  1   -0.156709
   2    0.112015
   3   -0.180330
b  1    1.330953
   2   -0.830793
   3   -0.825411
c  1    0.298686
   2    0.396654
d  2   -1.135701
   3   -0.998360
dtype: float64

In [230]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                 index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns = [['Ohio', 'Ohio', ' Colorado'],
                           ['Green', 'Red', 'Red']])
frame

     Ohio      Colorado
    Green Red       Red
a 1     0   1         2
  2     3   4         5
b 1     6   7         8
  2     9  10        11

In [231]:
frame.index.names = ['key1', 'key2']

In [232]:
frame.columns.names = ['state', 'color']

In [233]:
frame

state      Ohio      Colorado
color     Green Red       Red
key1 key2
a    1        0   1         2
     2        3   4         5
b    1        6   7         8
     2        9  10        11

In [234]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [236]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                       ['Green', 'Red', 'Green']],
                      names = ['state', 'color'])

MultiIndex(levels=[[u'Colorado', u'Ohio'], [u'Green', u'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=[u'state', u'color'])

In [237]:
# Reordering and sorting levels
frame.swaplevel('key1', 'key2')

state      Ohio      Colorado
color     Green Red       Red
key2 key1
1    a        0   1         2
2    a        3   4         5
1    b        6   7         8
2    b        9  10        11

In [238]:
frame.sortlevel(1)

state      Ohio      Colorado
color     Green Red       Red
key1 key2
a    1        0   1         2
b    1        6   7         8
a    2        3   4         5
b    2        9  10        11

In [239]:
# Summary statistics by level
frame.sum(level = 'key2')

state  Ohio      Colorado
color Green Red       Red
key2
1         6   8        10
2        12  14        16

In [240]:
frame.sum(level = 'color', axis = 1)

color      Green  Red
key1 key2
a    1         0    3
     2         3    9
b    1         6   15
     2         9   21

In [243]:
# Using a DataFrame's Columns
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                  'c': ['one', 'one', 'one', 'two', 'two', 
                        'two', 'two'],
                  'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [244]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [245]:
frame.set_index(['c', 'd'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [246]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [247]:
# Integer indexing
ser = Series(np.arange(3.))

In [248]:
ser[-1] # will create error

KeyError: -1

In [249]:
# pandas cannot tell if you want position or label-based indexing

In [250]:
ser2 = Series(np.arange(3.), index = ['a', 'b', 'c'])

In [251]:
ser2[-1] # this now works as we have explicitly labelled the index

2.0

In [252]:
ser3 = Series(range(3), index = [-5, 1, 3])

In [256]:
ser3.iloc[2]

2

In [257]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index = [2, 0, 1])

In [259]:
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64

In [260]:
# Panel data
import pandas.io.data as web
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009',
                                              '6/1/2012'))
                     for stk in ['AAPL', 'GOOGL', 'MSFT', 'DELL']))

In [261]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [262]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                 AAPL      DELL       GOOGL       MSFT
Date
2009-01-02  12.122906  10.39902  160.820818  17.068378
2009-01-05  12.634540  10.26359  164.189196  17.227896
2009-01-06  12.426146  10.68922  167.197207  17.429391
2009-01-07  12.157638  10.78596  161.166170  16.379934
2009-01-08  12.383398  10.90204  162.757769  16.892070
2009-01-09  12.100196  10.75694  157.692690  16.388330
2009-01-12  11.843712  10.30228  156.501497  16.346350
2009-01-13  11.716805  10.40869  157.317324  16.640199
2009-01-14  11.398871   9.97338  150.635637  16.027316
2009-01-15  11.138379  10.19587  149.644640  16.153251
2009-01-16  10.998114   9.93469  149.984987  16.547846
2009-01-20  10.446405   9.52840  141.516527  15.515180
2009-01-21  11.064907   9.86697  151.691698  16.270789
2009-01-22  11.803636   9.65416  153.403399  14.364976
2009-01-23  11.803636   9.80893  162.512514  14.440537
2009-01-26  11.974626   9.97338  162.097109  14.801549
2009-01-27  12.120234   9.74122  165.905916  14.826736
2009-01-28  12.583777  10.52477  174.509508  15.145772
2009-01-29  12.423474   9.62514  171.831835  14.767967
2009-01-30  12.040083   9.18983  169.434435  14.356580
2009-02-02  12.224431   9.00603  170.455462  14.969463
2009-02-03  12.420802   9.45101  170.395403  15.531972
2009-02-04  12.496946   9.47036  171.671679  15.641115
2009-02-05  12.885680   9.12212  177.037035  15.985338
2009-02-06  13.321170   9.15114  185.825839  16.505868
2009-02-09  13.693875   9.32526  189.574572  16.321164
2009-02-10  13.068694   8.86093  179.434435  15.783841
2009-02-11  12.933772   8.72550  179.199206  16.128063
2009-02-12  13.261057   8.87060  181.706713  16.170042
2009-02-13  13.246362   8.82224  179.019015  16.027316
...               ...       ...         ...        ...
2012-04-23  76.370966  15.57434  299.099094  29.113020
2012-04-24  74.845421  15.65173  300.935947  28.931745
2012-04-25  81.487306  15.88390  305.165165  29.185533
2012-04-26  81.180055  15.99030  308.043034  29.103958
2012-04-27  80.552206  15.90324  307.797794  28.986127
2012-04-30  78.011400  15.83553  302.727726  29.022383
2012-05-01  77.764270  15.86455  302.517521  29.013318
2012-05-02  78.278571  15.64689  303.933933  28.822978
2012-05-03  77.722856  15.70010  305.815830  28.786724
2012-05-04  75.509341  15.29381  298.783787  28.079744
2012-05-07  76.074409  15.30348  304.079075  27.780638
2012-05-08  75.900747  15.19708  306.701695  27.644681
2012-05-09  76.034336  15.15838  304.879887  27.880341
2012-05-10  76.213334  15.04230  307.137150  27.862213
2012-05-11  75.704377  14.91654  302.917912  28.242893
2012-05-14  74.570231  14.93589  302.302311  27.807830
2012-05-15  73.895624  14.83916  305.860874  27.561498
2012-05-16  72.948503  14.52477  314.779789  27.278677
2012-05-17  70.816475  14.45222  311.836857  27.114457
2012-05-18  70.851205  14.25875  300.500492  26.703909
2012-05-21  74.979002  14.48124  307.362370  27.141827
2012-05-22  74.403254  14.58765  300.700718  27.150951
2012-05-23  76.218678  12.08221  305.035038  26.557936
2012-05-24  75.518694  12.04351  302.132145  26.521442
2012-05-25  75.113925  12.05319  296.061069  26.512319
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  76.447109  12.24666  297.467472  26.968484
2012-05-30  77.368854  12.14992  294.409428  26.767772
2012-05-31  77.176494  11.92743  290.720737  26.630923
2012-06-01  74.940263  11.67592  285.775791  25.955799

[868 rows x 4 columns]

In [263]:
pdata.ix[:, '6/1/2012', :]

             Open        High         Low       Close     Volume   Adj Close
AAPL   569.159996  572.650009  560.520012  560.989983  130246900   74.940263
DELL    12.150000   12.300000   12.045000   12.070000   19397600   11.675920
GOOGL  571.790011  572.649990  568.350034  570.980030    6109600  285.775791
MSFT    28.760000   28.959999   28.440001   28.450001   56634300   25.955799

In [264]:
pdata.ix['Adj Close', '5/22/2012':, :]

                 AAPL      DELL       GOOGL       MSFT
Date
2012-05-22  74.403254  14.58765  300.700718  27.150951
2012-05-23  76.218678  12.08221  305.035038  26.557936
2012-05-24  75.518694  12.04351  302.132145  26.521442
2012-05-25  75.113925  12.05319  296.061069  26.512319
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  76.447109  12.24666  297.467472  26.968484
2012-05-30  77.368854  12.14992  294.409428  26.767772
2012-05-31  77.176494  11.92743  290.720737  26.630923
2012-06-01  74.940263  11.67592  285.775791  25.955799

In [265]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           GOOGL  588.159977  591.900008  583.530029  588.230036    3809500
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           GOOGL  588.720024  589.999993  579.000018  580.860033    5930600
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           GOOGL  571.790011  572.649990  568.350034  570.980030    6109600
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300

                   Adj Close
Date       minor
2012-05-30 AAPL    77.368854
           DELL    12.149920
           GOOGL  294.409428
           MSFT    26.767772
2012-05-31 AAPL    77.176494
           DELL    11.927430
           GOOGL  290.720737
           MSFT    26.630923
2012-06-01 AAPL    74.940263
           DELL    11.675920
           GOOGL  285.775791
           MSFT    25.955799

In [266]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT